[net]
batch=64
subdivisions=8
width=608
height=608
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.00261
burn_in=1000
max_batches=500500
policy=steps
steps=400000,450000
scales=.1,.1
mosaic=1

[convolutional]
batch_normalize=1
filters=21
size=3
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=51
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=59
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=22
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=59
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=60
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -7

[convolutional]
batch_normalize=1
filters=58
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=112
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=61
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=63
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=47
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=63
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=62
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -7

[convolutional]
batch_normalize=1
filters=109
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=78
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=44
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=109
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -7

[convolutional]
batch_normalize=1
filters=187
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=281
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=91
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=136
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -4

[convolutional]
batch_normalize=1
filters=92
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=109
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=203
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -4

[convolutional]
batch_normalize=1
filters=102
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=102
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=60
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=102
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=37

[convolutional]
batch_normalize=1
filters=71
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=296
activation=leaky

[convolutional]
batch_normalize=1
filters=82
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=92
activation=leaky

[convolutional]
batch_normalize=1
filters=97
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=30

[convolutional]
batch_normalize=1
filters=22
size=1
stride=1
pad=1
activation=leaky

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=59
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=51
activation=leaky

[convolutional]
batch_normalize=1
filters=60
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=92
activation=leaky

[convolutional]
batch_normalize=1
filters=59
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=49
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=0,1,2
anchors=12,16, 19,36, 40,28, 36,75, 76,55, 72,146, 142,110, 192,243, 459,401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

[route]
layers=-4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=34
activation=leaky

[route]
layers=-1, -16

[convolutional]
batch_normalize=1
filters=97
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=98
activation=leaky

[convolutional]
batch_normalize=1
filters=97
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=116
activation=leaky

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=51
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=3,4,5
anchors=12,16, 19,36, 40,28, 36,75, 76,55, 72,146, 142,110, 192,243, 459,401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
scale_x_y=1.1
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

[route]
layers=-4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=57
activation=leaky

[route]
layers=-1, -37

[convolutional]
batch_normalize=1
filters=75
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=102
activation=leaky

[convolutional]
batch_normalize=1
filters=81
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=102
activation=leaky

[convolutional]
batch_normalize=1
filters=97
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=102
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

[yolo]
mask=6,7,8
anchors=12,16, 19,36, 40,28, 36,75, 76,55, 72,146, 142,110, 192,243, 459,401
classes=80
num=9
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1
scale_x_y=1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6

