[net]
batch = 64
subdivisions = 8
width = 416
height = 416
channels = 3
momentum = 0.949
decay = 0.0005
angle = 0
saturation = 1.5
exposure = 1.5
hue = .1
learning_rate = 0.00261
burn_in = 1000
max_batches = 500500
policy = steps
steps = 400000,450000
scales = .1,.1
mosaic = 1

[convolutional]
batch_normalize = 1
filters = 21
size = 3
stride = 1
pad = 1
activation = mish

[convolutional]
batch_normalize = 1
filters = 51
size = 3
stride = 2
pad = 1
activation = mish


