[net]
batch=64
subdivisions=8
width=608
height=608
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.00261
burn_in=1000
max_batches=500500
policy=steps
steps=400000,450000
scales=.1,.1
mosaic=1

[convolutional]
batch_normalize=1
filters=21
size=3
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=51
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=59
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=22
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=59
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=60
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -7

[convolutional]
batch_normalize=1
filters=58
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=112
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=61
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=63
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=47
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=63
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=62
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -7

[convolutional]
batch_normalize=1
filters=109
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=216
size=3
stride=2
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=78
size=1
stride=1
pad=1
activation=mish

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=44
size=1
stride=1
pad=1
activation=mish

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=109
size=1
stride=1
pad=1
activation=mish

[route]
layers=-1, -7

[convolutional]
batch_normalize=1
filters=187
size=1
stride=1
pad=1
activation=mish


